#### pyhton 라이브러리(패키지)
- 크롤링: requests + BeautifulSoup / Selenium
- 데이터 분석 : pandas
- 숫자(배열, 행렬) 계산 : numpy
- 머신러닝/딥러닝 : scikit-learn, Pytorch, TensorFlow

In [ ]:
# !pip install pandas

Collecting pandas
  Downloading pandas-3.0.1-cp314-cp314-win_amd64.whl.metadata (19 kB)
Collecting numpy>=2.3.3 (from pandas)
  Downloading numpy-2.4.2-cp314-cp314-win_amd64.whl.metadata (6.6 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\source\pythonsource\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting tzdata (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\source\pythonsource\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-3.0.1-cp314-cp314-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   ---------------------------------------- 9.9/9.9 MB 59.9 MB/s  0:00:00
Downloading numpy-2.4.2-cp314-cp314-win_amd64.whl (12.4 MB)
   ---------------------------------------- 0.0/12.4 MB ? eta -:--:--
   ---------------------------------------  12.3/12.4 MB 66.6 MB/s eta 0:00:01
   ---------------------------------------- 12.4/12.4 MB 60.8 MB/s  0:00:00
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: tzdata, numpy, pandas

   ---------------------------------------- 0/3 [tzdata]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   ---------------------------------------- 3/3 [pandas]

Successfully installed numpy-2.4.2 pandas-3.0.1 tzdata-2025.3

[notice] A new release of pip is available: 25.3 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

#### Pandas
- 테이블 형태의 데이터를 다루는데 사용하는 데이터 분석 패키지
- 구조 - Series, DataFrame

In [2]:
import pandas as pd

In [3]:
series = pd.Series([70, 60, 90])
series

0    70
1    60
2    90
dtype: int64

In [4]:
series = pd.Series({"a":1, "b":2,"c":3})
series

a    1
b    2
c    3
dtype: int64

In [ ]:
series = pd.Series({"a":1, "b":2,"c":3})
series

a    1
b    2
c    3
dtype: int64

In [ ]:
# 열 하나일 때, Series

series = pd.Series([70, 60, 90], index=["국어","영어","수학"])
series

국어    70
영어    60
수학    90
dtype: int64

In [8]:
series.국어
print(series.국어)
print(series.index)
print(series.values)
print(series.shape) # 튜플 (3, ) : 3행
print(series.head(1))
print(series.tail(1))

70
Index(['국어', '영어', '수학'], dtype='str')
[70 60 90]
(3,)
국어    70
dtype: int64
수학    90
dtype: int64

In [11]:
# 수정
# 인덱스 수정
series.index = ["미술", "음악","체육"]
series

# dtype : int64 -> int 64비트 표현
# java : int 4byte, long 8 byte

# 타입 변경
series = series.astype("int32")
series

미술    70
음악    60
체육    90
dtype: int32

In [12]:
# 제거

del series['미술']
series

음악    60
체육    90
dtype: int32

In [13]:
# DataFrame : 가장 많이 사용

friend_dict_list = [
    {
        "name":"John",
        "age":35,
        "job":"student"
    },
    {
        "name":"Nate",
        "age":30,
        "job":"teacher"
    },
    {
        "name":"Jenny",
        "age":32,
        "job":"developer"
    }
]

In [14]:
friend_df = pd.DataFrame(friend_dict_list)
friend_df

    name  age        job
0   John   35    student
1   Nate   30    teacher
2  Jenny   32  developer

In [15]:
dict = {"국어":[15,25,35], "영어":[44,55,65], "수학":[36,46,56]}
student_df = pd.DataFrame(dict)
student_df

   국어  영어  수학
0  15  44  36
1  25  55  46
2  35  65  56

In [16]:
person_df = pd.DataFrame(friend_dict_list, index=["f1","f2","f3"])
person_df

     name  age        job
f1   John   35    student
f2   Nate   30    teacher
f3  Jenny   32  developer

In [19]:
list1 = [
    [1,2,3,4,5],
    [6,7,8,9,10]
]

two_df = pd.DataFrame(list1, index=["내용1","내용2"], columns=["c1","c2","c3","c4","c5"])
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  10

In [25]:
sample_df1 = pd.read_csv("./data/sample1.csv", encoding="cp949", index_col=0)
sample_df1

     이름                 가입일시  나이
번호
1   김정수  2017-01-19 11:30:00  25
2   박민구  2017-02-07 10:22:00  35
3   정순미  2017-01-22 09:10:00  33
4   김정현  2017-02-22 14:09:00  45
5   홍미진  2017-04-01 18:00:00  17
6   김순철  2017-05-14 22:33:07  22
7   이동철  2017-03-01 23:44:45  27
8   박지숙  2017-01-11 06:04:18  30
9   김은미  2017-02-08 07:44:33  51
10  장혁철  2017-12-01 13:01:11  16

In [24]:
sample_df2= pd.read_csv("./data/sample3.csv", encoding="cp949", delimiter="|", header=None, index_col=0)
sample_df2

     1                    2   3
0
1  김정수  2017-01-18 11:30:00  25
2  박민구  2017-02-07 10:22:00  35
3  정순미  2017-01-22 09:10:00  33
4  김정현  2017-02-22 14:30:00  45
5  홍미진  2017-01-18 11:30:00  24
6  이동철  2017-03-01 23:30:00  27
7  김은미  2017-04-01 23:30:00  25

In [28]:
file_df = pd.read_excel("./data/file1.xlsx", header=None)
file_df

    0   1   2   3   4   5   6   7   8   9
0  23  41  89   9  53  60  50  46  72  73
1   8  39  53  20  66  18  43  86  29  69
2  12  60  52  70  81  35  90  43  47  31
3  87  63  47  30  79  53  21  15  34  64
4  88  94  17  47  77  95  63  24  11  10
5  93  56  85  52  32   8  56  39  53  65
6  34  85  30   7  96  80  78  23  57  88
7  66  32  63  19  10  49  43   2  68  80
8  31  25  52  42  98  82  41  98  27  61
9  90  58  42   4  66  73  94  82  12   6

In [ ]:
# 조회

print(friend_df.index) # index 조회
print(friend_df.columns) # colums 조회
print(friend_df.values) # values 조회

# 필드명이 한글인 경우
print(friend_df.age) # filed name 조회
print(friend_df['age']) # filed name 조회

RangeIndex(start=0, stop=3, step=1)
Index(['name', 'age', 'job'], dtype='str')
[['John' 35 'student']
 ['Nate' 30 'teacher']
 ['Jenny' 32 'developer']]
0    35
1    30
2    32
Name: age, dtype: int64
0    35
1    30
2    32
Name: age, dtype: int64

In [34]:
# Nate 정보만 추출: 슬라이싱
# friend_df.loc[1]
print(friend_df.loc[1])
print(friend_df.loc[0:1])

name       Nate
age          30
job     teacher
Name: 1, dtype: object
   name  age      job
0  John   35  student
1  Nate   30  teacher

In [ ]:
print(friend_df.iloc[1])
# iloc: 마지막 자리 포함 안함
print(friend_df.iloc[0:1])

name       Nate
age          30
job     teacher
Name: 1, dtype: object
   name  age      job
0  John   35  student

In [36]:
student_df

   국어  영어  수학
0  15  44  36
1  25  55  46
2  35  65  56

In [37]:
student_df.loc[2]

국어    35
영어    65
수학    56
Name: 2, dtype: int64

In [ ]:
# loc : lable(이름) location

student_df.loc[1:3, "국어"]

1    25
2    35
Name: 국어, dtype: int64

In [ ]:
# iloc: index location

student_df.iloc[1:3, 0]

1    25
2    35
Name: 국어, dtype: int64

In [40]:
person_df

     name  age        job
f1   John   35    student
f2   Nate   30    teacher
f3  Jenny   32  developer

In [41]:
# John, Nate info

person_df.loc["f1":"f2","age"]

f1    35
f2    30
Name: age, dtype: int64

In [44]:
person_df.iloc[0:2, 1]

f1    35
f2    30
Name: age, dtype: int64

In [46]:
# friend_df 에서 age>=25 조회

friend_df[friend_df.age >=31]

    name  age        job
0   John   35    student
2  Jenny   32  developer

In [ ]:
# 25 보다 크고, 이름이 Nate 인 사람 조회

# Python:  age > 25 and name == 'Nate'

friend_df[friend_df.age >=31]
friend_df[(friend_df.age > 20) & (friend_df.name =='Nate')]

   name  age      job
1  Nate   30  teacher

In [51]:
student_df[student_df.국어 >= 20]
student_df[student_df["국어"] >= 20]

   국어  영어  수학
1  25  55  46
2  35  65  56

In [68]:
# sample.xlxs 로 실습 

# sample.xlsx -> sample_df 로 생성
sample_df = pd.read_excel("./data/sample.xlsx")
sample_df.head(2)

  Sap Co.      대리점 영업사원       전월       금월  TEAM  총 판매수량
0  KI1316  경기수원대리점  이기정  1720000  2952000     1     123
1  KI1451  충청홍성대리점  정미진  4080000  2706000     2     220

In [62]:
# 총 판매수량 > 250 조회
sample_df[sample_df["총 판매수량"]>250]

   Sap Co.       대리점 영업사원       전월       금월  TEAM  총 판매수량
2   KI1534   경기화성대리점  경인선   600000  2214000     1     320
14  KI2776  경기남양주대리점  김수진  8160000  4352000     2     354
18  KI3131   경기하남대리점  김민정  2750000  7268000     3     293

In [65]:
# 2-3행 조회
sample_df.loc[2:3]

  Sap Co.      대리점 영업사원       전월       금월  TEAM  총 판매수량
2  KI1534  경기화성대리점  경인선   600000  2214000     1     320
3  KI1636  강원속초대리점  이동권  3720000  2870000     3     110

In [69]:
# 금월 컬럼 조회
sample_df['금월']

0     2952000
1     2706000
2     2214000
3     2870000
4     2296000
5     2346000
6     1518000
7     2139000
8     2484000
9     1518000
10     945000
11    1404000
12    2312000
13    4760000
14    4352000
15    3400000
16    4896000
17    3128000
18    7268000
19    4740000
Name: 금월, dtype: int64

In [71]:
# 여러 행에서, 연속되지 않은 컬럼명 여러 개 조회
# 2-3 행 조회, [대리점명, 총 판매수량] 반드시 묶어야 한다. 

sample_df.loc[2:3, ["대리점", "총 판매수량"]]
sample_df.iloc[2:4, [1,6]]

       대리점  총 판매수량
2  경기화성대리점     320
3  강원속초대리점     110

In [75]:
# Nate -> Torres 로 변경

friend_df.iloc[1,0] = 'Torres'
friend_df

     name  age        job
0    John   35    student
1  Torres   30    teacher
2   Jenny   32  developer

In [77]:
# 3 번 행 추가

friend_df.loc[3] = ["Mike",30,"student"]
friend_df

     name  age        job
0    John   35    student
1  Torres   30    teacher
2   Jenny   32  developer
3    Mike   30    student

In [79]:
# 컬럼 추가
friend_df['addr'] = ['Seoul', 'Geyonggi', "Busan", "Daegu"]
friend_df

     name  age        job      addr
0    John   35    student     Seoul
1  Torres   30    teacher  Geyonggi
2   Jenny   32  developer     Busan
3    Mike   30    student     Daegu

In [ ]:
# age 컬럼 지우기
friend_df = friend_df.drop("age", axis=1)

In [90]:
friend_df

     name      addr
0    John     Seoul
1  Torres  Geyonggi
2   Jenny     Busan
3    Mike     Daegu

In [ ]:
# age 컬럼 제거 ( 원본 변경 )
friend_df.drop("job",axis=2,inplace=True)

In [91]:
friend_df

     name      addr
0    John     Seoul
1  Torres  Geyonggi
2   Jenny     Busan
3    Mike     Daegu

In [92]:
student_df

   국어  영어  수학
0  15  44  36
1  25  55  46
2  35  65  56

In [93]:
# 과학 컬럼 추가
student_df["과학"] = [65, 85, 95]

In [94]:
student_df

   국어  영어  수학  과학
0  15  44  36  65
1  25  55  46  85
2  35  65  56  95

In [ ]:
# csv 파일 저장 시, 보통 index=False를 같이 넣는다.
student_df.to_csv("./data/student.csv", index=False)

:

크롤링 -> csv -> pandas에서 정리 -> 정리 끝나면 돌아와서 저장